from gensim.summarization.summarizer import summarize
text = """소년은 개울가에서 소녀를 보자 곧 윤 초시네 증손녀(曾孫女)딸이라는 걸 알 수 있었다.
벌써 며칠째 소녀는, 학교에서 돌아오는 길에 물장난이었다.
소년은 개울둑에 앉아 버렸다.
소녀가 비키기를 기다리자는 것이다.
요행 지나가는 사람이 있어, 소녀가 길을 비켜 주었다.
이 날은 소녀가 징검다리 한가운데 앉아 세수를 하고 있었다.
소녀는 소년이 개울둑에 앉아 있는 걸 아는지 모르는지 그냥 날쌔게 물만 움켜 낸다.
그러다가 소녀가 물 속에서 무엇을 하나 집어 낸다.
소년은 저도 모르게 벌떡 일어섰다.
단발 머리를 나풀거리며 소녀가 막 달린다.
그러고도 상당한 시간이 지났다고 생각됐다.
소녀가 갈꽃을 안고 있었다.
소년은 이 갈꽃이 아주 뵈지 않게 되기까지 그대로 서 있었다.
문득, 소녀가 던지 조약돌을 내려다보았다.
소녀의 그림자가 뵈지 않았다.
소녀의 그림자가 뵈지 않는 날이 계속될수록 소년의 가슴 한 구석에는 어딘가 허전함이 자리 잡는 것이었다.
그러한 어떤 날, 소년은 전에 소녀가 앉아 물장난을 하던 징검다리 한가운데에 앉아 보았다.
소년은 두 손으로 물 속의 얼굴을 움키었다.
소녀가 이리로 건너오고 있지 않느냐.
‘숨어서 내가 하는 일을 엿보고 있었구나.’ 소년은 달리기를 시작했다.
소년은 한 손으로 코피를 훔쳐내면서 그냥 달렸다.
개울가에 이르니, 며칠째 보이지 않던 소녀가 건너편 가에 앉아 물장난을 하고 있었다.
여기서 소녀는 아래편으로 한 삼 마장쯤, 소년은 우대로 한 십 리 가까운 길을 가야 한다.
소녀의 눈이 금새 ‘바보,바보,’할 것만 같았다.
허수아비가 서 있었다.
‘참, 오늘은 일찍 집으로 돌아가 텃논의 참새를 봐야 할걸.’ 하는 생각이 든다.
소녀가 그리로 달려간다.
소녀가 먼저 뛰어 건넜다.
그리고는 이렇게 먹어야 한다는 듯이, 먼저 대강이를 한 입 베물어 낸 다음, 손톱으로 한 돌이 껍질을 벗겨 우쩍 깨문다.
소녀가 산을 향해 달려갔다.
이번은 소년이 뒤따라 달리지 않았다.
그러나 소녀는
소녀가 조용히 일어나 비탈진 곳으로 간다.
소녀가 손을 내밀었다.
소년은 저도 모르게 생채기에 입술을 가져다 대고 빨기 시작했다.
좀 만에 숨이 차 돌아온 소년은
이것만은 소녀가 흉내 내지 못할, 자기 혼자만이 할 수 있는 일인 것이다.
그러나, 원두막은 기둥이 기울고 지붕도 갈래갈래 찢어져 있었다.
무명 겹저고리를 벗어 소녀의 어깨를 싸 주었다.
소녀는 비에 젖은 눈을 들어 한 번 쳐다보았을 뿐, 소년이 하는 대로 잠자코 있었다.
소녀가 들어선 곳도 비가 새기 시작했다.
세워 놓은 수숫단 속을 비집어 보더니, 옆의 수숫단을 날라다 덧세운다.
소녀가 속삭이듯이, 이리 들어와 앉으라고 했다.
소녀가 다시, 들어와 앉으라고 했다.
그러나, 소녀는 상관없다고 생각했다.
그러나, 고개를 돌리지 않았다.
소녀는 ‘어머나’소리를 지르며 소년의 목을 끌어안았다.
그 뒤로 소녀의 모습은 뵈지 않았다.
그러나, 뵈지 않았다.
그날도 소년은 주머니 속 흰 조약돌만 만지작거리며 개울가로 나왔다.
그랬더니, 이 쪽 개울둑에 소녀가 앉아 있는 게 아닌가.
어쩐지 소녀의 얼굴이 해쓱해져 있었다.
소녀가 가만히 고개를 끄덕이었다.
소녀가 분홍 스웨터 앞자락을 내려다본다.
소녀가 가만히 보조개를 떠올리며,
소년은 스웨터 앞자락만 바라보고 있었다.
소년은 얼굴이 확 달아오름을 느꼈다.
소년은 주춤한다.
소년은 소녀네가 이사해 오기 전에 벌써 어른들의 이야기를 들어서, 윤 초시 손자(孫子)가 서울서 사업에 실패해 가지고 고향에 돌아오지 않을 수 없게 되었다는 걸 알고 있었다.
소녀와 헤어져 돌아오는 길에, 소년은 혼잣속으로, 소녀가 이사를 간다는 말을 수없이 되뇌어 보았다.
그렇건만, 소년은 지금 자기가 씹고 있는 대추알의 단맛을 모르고 있었다.
이 날 밤, 소년은 몰래 덕쇠 할아버지네 호두밭으로 갔다.
이튿날, 소년이 학교에서 돌아오니, 아버지가 나들이옷으로 갈아입고 닭 한 마리를 안고 있었다.
소년이 이번에는 어머니한테 아버지가 어디 가시느냐고 물어 보았다.
소년은 갈림길에서 아래쪽으로 가 보았다.
갈밭머리에서 바라보는 서당골 마을은 쪽빛 하늘 아래 한결 가까워 보였다.
소년은 저도 모르게 주머니 속 호두알을 만지작거리며, 한 손으로는 수없이 갈꽃을 휘어 꺾고 있었다."""


print(summarize(text))
